# Используем официальный образ Nginx на базе Alpine Linux
FROM nginx:alpine

# Копируем все файлы CMS в директорию, которую Nginx использует для раздачи контента
COPY . /usr/share/nginx/html

# (Опционально) Если вам нужно настроить дополнительные параметры Nginx, можно скопировать свой конфигурационный файл.
# Например, если вы хотите использовать кастомный конфиг, создайте файл nginx.conf и добавьте:
# COPY nginx.conf /etc/nginx/conf.d/default.conf

# Образ по умолчанию уже слушает порт 80
EXPOSE 80
